public/reading/stoicism/stoicism-ethics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../index.html">Giovanni's Diary</a> &gt; <a href="../reading.html">Reading</a> &gt; <a href="stoicism.html">Stoicism</a> &gt; <a href="notes.html">Notes</a> &gt;
</p>

<div id="outline-container-org3853dc7" class="outline-2">
<h2 id="org3853dc7">Stoicism's Ethics Notes</h2>
<div class="outline-text-2" id="text-org3853dc7">
</div>

<div id="outline-container-org236a22a" class="outline-4">
<h4 id="org236a22a">Index</h4>
<div class="outline-text-4" id="text-org236a22a">
<ol class="org-ol">
<li>Core Ideas</li>
<li>Virtue</li>
<li>Ethics</li>
<li>Good and Virtue</li>
<li>Value</li>
<li>Emotions</li>
<li>Justice and Cosmopolitanism</li>
</ol>

<p>
<b><b>Sources</b></b>: everything discussed in this page is based on the book
"La ricerca del pensiero. Storia, testi e problemi della filosofia"
volume 1B by Nicola Abbagnano and Giovanni Fornero.
</p>
</div>
</div>

<div id="outline-container-org2144252" class="outline-4">
<h4 id="org2144252">Core Ideas</h4>
<div class="outline-text-4" id="text-org2144252">
<p>
The school of Stoicism was founded by Zeno of Citium (approximately
336 - 264 a.C.), It was named after the place where they held public
lectures, which was supposed to be an open space where everyone could
participate in discussions. He thought that <b><b>life needed to be lived
following philosophy (science) to reach wisdom by exercising virtue</b></b>:
"Philosophy is exercise of virtue, through virtue itself; because
there cannot be virtue without exercising, neither exercising virtue
without virtue" - Seneca.
</p>
</div>
</div>

<div id="outline-container-orga69425f" class="outline-4">
<h4 id="orga69425f">Virtue</h4>
<div class="outline-text-4" id="text-orga69425f">
<p>
Virtue was divided into the natural, the moral and
reason. Consequently, philosophy was divided into <b><b>physics</b></b>,
<b><b>ethics</b></b> and <b><b>logic</b></b>. In early teachings, logic was the foundation
of everything else therefore It was taught first. In physics, they
thought that there was an universal order in nature, which is
destiny. God was nature itself, forever present in everything and
perfect. I will now focus on the ethics since It is the most relevant
part nowadays.
</p>
</div>
</div>

<div id="outline-container-org7896f9d" class="outline-4">
<h4 id="org7896f9d">Ethics</h4>
<div class="outline-text-4" id="text-org7896f9d">
<p>
Ethics is based around the idea that every human tends to live in
harmony with the world and nature, which is perfect. This tendency was
referred to as "oikeiôsis" which could be translated to "orientation"
or "affinity". This process is moved by two forces: <b><b>instinct</b></b>,
which guides the animal to seek food and breed for his own survival,
and <b><b>reason</b></b>, which connects an human with himself and with nature in
general. Acting towards this rational order is our duty:
</p>

<p>
"The term Duty is applied to that for which, when done, a reasonable
defense can be adduced. [&#x2026;] And it is an action in itself adapted to
nature's arrangements. [&#x2026;] Befitting acts are all those which reason
prevails with us to do: and this is the case with honoring one's
parents, brothers and country, and intercourse with
friends. Unbefitting, or contrary to duty, are all acts that reason
deprecates, e.g. to neglect one's parents, to be indifferent to one's
brothers, not to agree with friends, to disregard the interests of
one's country, and so forth. Acts which fall under neither of the
foregoing classes are those which reason neither urges us to do nor
forbids, such as picking up a twig, holding a style or a scraper, and
the like." - Lives of eminent philosophers by Diogenes Laertius,
Hicks, Robert Drew, 1850-1929, VII, 107-109.
</p>
</div>
</div>

<div id="outline-container-orgd1d809b" class="outline-4">
<h4 id="orgd1d809b">Good and Virtue</h4>
<div class="outline-text-4" id="text-orgd1d809b">
<p>
There is a distinction between good and virtue. Good is when the
rational choice is repeated with constancy until It becomes a natural
disposition, that is a virtue. Virtue can have different names based
on what It is referring to: <b><b>wisdom</b></b> for men's duties,
<b><b>temperance</b></b> for impulses, <b><b>fortress</b></b> for obstacle, and
<b><b>justice</b></b> for distributions of goods.
</p>

<p>
There is no middle ground between virtue and vice: like a piece of
wood is either straight or curve, a man is just or unjust, and not
partially one or the other. A man that is not wise is a madman, wild.
</p>
</div>
</div>

<div id="outline-container-org9c0e951" class="outline-4">
<h4 id="org9c0e951">Value</h4>
<div class="outline-text-4" id="text-org9c0e951">
<p>
If something does not constitute virtue, nor Its contrary, than they
are indifferent. Here stoicism tells us that if reason leads us
nowhere, for example a tragedy or wealth or beauty, we should be
indifferent. Still, sometimes there are things that should be
preferred to others that may contribute us to leave a life with
reason, which are referred to as "value".
</p>
</div>
</div>

<div id="outline-container-orge3f7b6f" class="outline-4">
<h4 id="orge3f7b6f">Emotions</h4>
<div class="outline-text-4" id="text-orge3f7b6f">
<p>
Stoic ethic rejects the value of emotions, they are just opinions not
driven by reason. They define four types of emotions: <b><b>lust</b></b> for
wealth, <b><b>delight</b></b> of wealth, <b><b>fear</b></b> of future evils, <b><b>affliction</b></b>
for present evils. In opposition to those, the wise should have power
of will, joy and caution. His condition is one of <b><b>apathy</b></b>, meaning
to be indifferent of any emotion. Note that stoicism does not say to
repress emotions, but not to engage with them at all.
</p>
</div>
</div>

<div id="outline-container-orga67710a" class="outline-4">
<h4 id="orga67710a">Justice and Cosmopolitanism</h4>
<div class="outline-text-4" id="text-orga67710a">
<p>
Since the natural order (and reason) is something common to everyone,
all humans have a <b><b>natural right</b></b> which is the base of modern
<b><b>justice</b></b>.  For the stoic, every human is a citizen of the world,
where everyone is free. The only possible enslavement is the one of
the mad with regards to his emotions when he does not act according to
reason.
</p>

<hr />

<p>
Travel: <a href="stoicism.html">Stoicism</a>, <a href="../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
